curriculum-vitae.tex
% Created 2024-10-21 Mon 19:48
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,a4paper,ragged2e,withhyper]{altacv}

% Change the page layout if you need to
\geometry{left=1.25cm,right=1.25cm,top=1.5cm,bottom=1.5cm,columnsep=1.2cm}

% Use roboto and lato for fonts
\renewcommand{\familydefault}{\sfdefault}

% Change the colours if you want to
\definecolor{SlateGrey}{HTML}{2E2E2E}
\definecolor{LightGrey}{HTML}{666666}
\definecolor{DarkPastelRed}{HTML}{450808}
\definecolor{PastelRed}{HTML}{8F0D0D}
\definecolor{GoldenEarth}{HTML}{E7D192}
\colorlet{name}{black}
\colorlet{tagline}{PastelRed}
\colorlet{heading}{DarkPastelRed}
\colorlet{headingrule}{GoldenEarth}
\colorlet{subheading}{PastelRed}
\colorlet{accent}{PastelRed}
\colorlet{emphasis}{SlateGrey}
\colorlet{body}{LightGrey}

% Change some fonts, if necessary
\renewcommand{\namefont}{\Huge\rmfamily\bfseries}
\renewcommand{\personalinfofont}{\footnotesize}
\renewcommand{\cvsectionfont}{\LARGE\rmfamily\bfseries}
\renewcommand{\cvsubsectionfont}{\large\bfseries}

% Change the bullets for itemize and rating marker
% for cvskill if you want to
\renewcommand{\itemmarker}{{\small\textbullet}}
\renewcommand{\ratingmarker}{\faCircle}

\usepackage[rm]{roboto}
\usepackage[defaultsans]{lato}
\usepackage{paracol}
\usepackage[bottom]{footmisc}
\DeclareNameAlias{sortname}{given-family}
\addbibresource{aidan.bib}
\usepackage[style=trad-abbrv,sorting=none,sortcites=true,doi=false,url=false,giveninits=true,hyperref]{biblatex}
\author{Gaurav Sood}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Gaurav Sood},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.6)}, 
 pdflang={English}}
\begin{document}

\name{Gaurav Sood}
\photoR{2.8cm}{gaurav.jpeg}
\tagline{Sr. Data Scientist}

\personalinfo{
  \email{gsood.gaurav@gmail.com}
  \phone{+91 9632714987}
  \location{Bangalore, India}
  \github{github.com/gsood-gaurav}
  \linkedin{linkedin.com/in/gsood-gaurav/}
}
\makecvheader

\begin{paracol}{1}
 \begin{quote}
"Senior Data Scientist with 7 years of experience in Data Science and total experience of 14 years in software industry, contributing as and individual contributor and team leader, building machine learning models from conception to completion to improve operational efficiency. Worked on  Natural Language Processing, Time Series Forecasting, Tabular Datasets, Graph Neural Nets and  Reinforcement Learning.  Have experience in traditional machine learning methods (Probabilistic Graphical Models), deep learning models (LSTMs, CNNs) and Transformer based models (BERT, GPT and LLMs)"
 \end{quote}
\cvsection{Skills}
\label{sec:org5914739}
\cvtag{Python}
\cvtag{PyTorch}
\cvtag{TensorFlow}
\cvtag{JAX}
\cvtag{Julia}
\cvtag{Flux/Lux}
\cvtag{NumPy}
\cvtag{SciPy}
\cvtag{Matplotlib}


\divider

\cvtag{Large Language Models}
\cvtag{Generative AI}
\cvtag{Probabilistic Modelling}
\cvtag{Reinforcement Learning}
\cvtag{Open Source Software}
\divider

\cvtag{Communication}
\cvtag{Leadership Skills}

\cvsection{Experience}
\label{sec:org85a5f5e}
\cvevent{Sr. Data Scientist}{ HP Inc. May 2021 -- Ongoing}{ Bangalore, India}{}

\begin{itemize}
\item Designed and Developed Large Language Models(LLMs) Based application for web content
filtering and topic recommendation (Currently in beta phase.)
\item Implemented evaluation scripts to benchmark LLM based application's performance on
accuracy, cost(token usage) and inference time reducing cost by 30\%.
\item Mentored 3 data science interns on automating triaging with machine learning
on hardware logs using Graph Neural Networks and Generative Pretrained Transformer(GPT2)
\item Fine Tuned 4-bit quantized Small language Chat model TinyLLama(1B parameters) on custom data set using QLORA.
\item Developed Telemetery data analysis pipline processing 0.5 milllion customer record using Large Language Model
embeddings, BERT, dimensionality reduction(UMAP, Variational AutoEncoder) and
clustering HDBScan enhancing operational efficiency by 20\%.
\end{itemize}

\cvtag{Prompt Engineering}
\cvtag{GPT2}
\cvtag{Llama}
\cvtag{FineTuning}
\cvtag{Leadership Skills}
\cvtag{Embedding Models}
\cvtag{Graph Nerual Networks}
\par\divider
\cvevent{Sr. Software Engineer Machine Learning}{ HP Inc. July 2017 -- May 2021}{ Bangalore, India}{}

\begin{itemize}
\item Analyzed Sales Time Series Data (Short term/Long term demand forecasting to
improve supply chain processes) using statistical models, Tree based models
and Generalized Additive Models.
\item Analyzed the effects of macro economic indicators on Demand Forecasts to
optimize inventory management.
\item Implemented Hyperparameter Tuning module for Time Series models using Optuna
reducing the model execution time by 25\%.
\item Worked on HP Personal Systems User Behavior Modelling using Tree Based Models,
SHAP, UMAP, HDBScan for targeted market campaigning.
\item Developed simulator environment for online Reinforcement Learning for
automated hardware diagnostics.
\item Developed Sequence Tagging Model using BERT, LSTMs for discovering insights in
call center records which lead to 30\% increase in operational efficency.
\item Mentored 4 interns on sequence tagging using Conditional Random Fields to
extract insights from call center records.
\item Presented and communicated ideas about Probabilistic Modelling and
Reinforecement Learning to senior leadership
\item Analyzed Call center record using Bayesian Networks for predictive diagnostics
as an aid to call center executives.
\end{itemize}

\cvtag{Time Series Analysis}
\cvtag{CART}
\cvtag{Reinforcement Learning}
\cvtag{Probabilistic Graphical Models}
\cvtag{Data Annotation}

\par\divider
\cvevent{Senior Software Engineer}{ HP Inc. March 2015 -- June 2017}{ Bangalore, India}{}
\begin{itemize}
\item Designed and Developed a parser for PostScript Language to extract images and
meta data which was impacting 50000 hp customers and saving 0.5 million dollars.
\item Worked on understanding PDF specification, design and implemented PDF document
processing using PDF libraries like iText and PDFium
\item Lead a team of 4 software engineers which delivered imaging processing solutions using
Python Imaging Library, Tessaract OCR to over 10 PSU banks in india
\end{itemize}

\cvtag{Algorithms}
\cvtag{OpenSource Sofware}
\cvtag{Image Processing}
\cvtag{Leadership Skills}
\par\divider
\cvevent{Software Engineer}{ HP Inc. May 2010 -- Feb 2015}{ Bangalore, India}{}
\begin{itemize}
\item Designed and Implemented Telemetry module in python using asyncio.
\item Led team of 7 software developers designing and implementing open source
software used by over 1 million customers.
\item Collaborated with customers and stakeholders, gathering requirements and
communicating constraints.
\item Developed UI, backend, modules in Python for the hp's open source imaging
solution (\url{https://developers.hp.com/hp-linux-imaging-and-printing})
\end{itemize}

\cvtag{Python}
\cvtag{Open Source Software}
\cvtag{Asynchronous Programming}
\cvtag{Leadership Skills}

\cvsection{Certifications}
\label{sec:org14fd9a6}
\cvevent{Deep Learning Specialization}{ Coursera Oct-2021 Credential ID G8PG2GY6WFS)}{}{}
\cvevent{Reinforcement Learning Specialization}{ Coursera Sept-2021 Credential IDD3LDNU8BRW68}{}{}
\cvevent{Introduction to Quantum Computing}{ Coursera May-2021 Credential ID RXQHLEC2WYC8}{}{}
\nocite{*}
% \printbibliography[heading=pubtype,title={\printinfo{\faBook}{Books}},type=book]
% \divider
% \printbibliography[heading=pubtype,title={\printinfo{\faFile*[regular]}{Journal Articles}},type=article]
% \divider
\printbibliography[heading=pubtype,title={\printinfo{\faUsers}{Conference Proceedings}},type=inproceedings]

\cvsection{Preventive Disclosures}
\label{sec:org89d505f}
\begin{itemize}
\item Gaurav Sood, Ranjith Kumar Gopa, Nandan Kumar Nidhi(May 2024) "Representing
Tabular Data using Large Lanugage Models"
\url{https://www.tdcommons.org/dpubs\_series/6998/}
\item Gaurav Sood (Feb 2021) "A Reinforcement Learning Approach to Printer Diagnostics"
\url{https://www.tdcommons.org/dpubs\_series/4244/}
\item Gaurav	Sood, Pavleen Kaur Brar, Raghu Anantharangachar (April 2019)
"Sequence Prediction for Print/Scan Issues using Bayesian Networks"
\url{https://www.tdcommons.org/dpubs\_series/2117/}
\end{itemize}

\cvsection{Education}
\label{sec:org54b8149}
\cvevent{Msc Research \ Speech Recoginition}{ Indian Institute of Science Bangalore 2006-2009}{}{}
\begin{itemize}
\item \faBook Speech Recognition using Support Vector Machines
\end{itemize}

\divider

\cvevent{BTech Electronics and Communication Engg}{ GNE Ludhiana 2001-2005}{}{}

\end{paracol}
\end{document}
\end{document}
